[{
        "text": " Programming today is a race of software developers striving to write programs with more and better idiot resistance, and a universe that is trying to create more selective idiots. As long as the universe wins",
        "author": "Rick Cook"
    },

    {
        "text": "A low-level language is when attention is required to things that have nothing to do with programs in this language",
        "author": "Alan J. Perlis"
    },
    {
        "text": "C programming is like dancing fast on a freshly polished floor of people with sharp razors in their hands",
        "author": "Waldi Ravens"
    },


    {
        "text": "In good design, adding something costs less than the thing itself",
        "author": "Thomas C. Gale"
    },
    {
        "text": "In theory, theory and practice are inseparable. In practice, this is not the case",
        "author": "Yoggi Berra"
    },
    {
        "text": "Perl is the language that looks the same both before and after RSA encryption",
        "author": "Keith Bostic"
    },

    {
        "text": "Sometimes it's better to stay home on Monday than to spend the whole week debugging code written on Monday",
        "author": "Christopher Thompson"
    },
    {
        "text": "Measuring a programmer's productivity by counting lines of code is like judging an airplane's build by its weight",
        "author": "Bill Gates"
    },
    {
        "text": "Debugging code is twice as hard as writing it. So if you write code as smart as you can, then by definition you are not smart enough to debug it",
        "author": "Brian W Kernighan"
    },
    {
        "text": "Many of you are familiar with the virtues of being a programmer. There are only three of them, and of course this is: laziness, impatience and pride",
        "author": "Larry Wall"
    },
    {
        "text": "Most programs today are like Egyptian pyramids of a million bricks on top of each other and without constructive integrity - they are simply built by brute force and thousands of slaves",
        "author": "Alan Kay"
    },
    {
        "text": "Most good programmers do their jobs not because they expect to be paid or recognized, but because they enjoy programming",
        "author": "Linus Torvalds"
    },
    {
        "text": "Always write code as if it would be accompanied by a violent psychopath who knows where you live",
        "author": "Martin Golding"
    },
    {
        "text": "Programs must be written for the people who will read them, and the machines that will execute these programs are secondary",
        "author": "Harold Abelson"
    },
    {
        "text": "People who think they hate computers actually hate bad programmers",
        "author": "Larry Niven"
    },

    {
        "text": "A language that doesn 't change your understanding of programming is not worth learning",
        "author": "Alan J.Perlis"
    },
    {
        "text": "We are seeing a society that is increasingly dependent on machines, but at the same time uses them more and more inefficiently",
        "author": "Douglas Rushkoff"
    },
    {
        "text": "Sometimes the best programs are written on paper. Programming them is a secondary thing",
        "author": "Max Kanat-Alexander"
    },
    {
        "text": "Debugging code is like hunting. Hunting for bugs",
        "author": "Amit Kalantri"
    }
]